InformationRegisters/ПрикрепленныеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПрикрепленныеДанные</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Архивирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантАрхивации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыАрхивацииПрикрепленныхДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьАрхивации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАрхивации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФайлаGD</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПапкиGD</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидФайлаПрограммыПостроителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыФайловПрограммыПостроителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.УДАЛИТЬ_Замер</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаДоставку</v8:Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПрикрепленныеДанные/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьДанные(СсылкаНаОбъект, ИмяФайла)
	
	Возврат ОбщийМодульВызовСервера.ПолучитьДанныеФайла(СсылкаНаОбъект, ИмяФайла,, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Функция ПолучитьИмяВременногоФайлаСерв(Расширение)
	Возврат ПолучитьИмяВременногоФайла(Расширение);
КонецФункции

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		АдресФайла = ПолучитьДанные(ТекущиеДанные.СсылкаНаОбъект, ТекущиеДанные.ИмяФайла);
		Если НЕ АдресФайла = Неопределено Тогда // №7253
			ВременноеИмя = ПолучитьИмяВременногоФайлаСерв(ТекущиеДанные.Расширение);
	    	ПолучитьФайл(АдресФайла, ВременноеИмя, Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.ОбъектОтбор = Неопределено И ЗначениеЗаполнено(Параметры.ОбъектОтбор) Тогда
		
		ЭО=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭО.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
		ЭО.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("СсылкаНаобъект");
		ЭО.ПравоеЗначение=Параметры.ОбъектОтбор.Ссылка;
		ЭО.Использование=Истина;
		
	КонецЕсли;
	
	//++ №14707
	Если Параметры.Отбор.Свойство("СсылкаНаОбъект") Тогда
		ВладелецФайла = Параметры.Отбор.СсылкаНаОбъект;
	КонецЕсли;
	//-- №14707
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	АдресФайла = ПолучитьДанные(ТекущиеДанные.СсылкаНаОбъект, ТекущиеДанные.ИмяФайла);
	
	Если НЕ АдресФайла = Неопределено Тогда // №7253
		ВременноеИмя = ПолучитьИмяВременногоФайлаСерв(ТекущиеДанные.Расширение);
		ПолучитьФайл(АдресФайла, ВременноеИмя, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайл(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	//++ №14707
	Если НЕ ВладелецФайла = Неопределено И ЗначениеЗаполнено(ВладелецФайла) Тогда
		СсылкаНаОбъект = ВладелецФайла;
	//-- №14707
	ИначеЕсли ТекущиеДанные = Неопределено Тогда
		Возврат;
	Иначе
		СсылкаНаОбъект = ТекущиеДанные.СсылкаНаОбъект;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПрикрепленияФайлаЗавершение", ЭтотОбъект);
	ДопПараметры = Новый Структура("ДействиеПослеПрикрепления", ОписаниеОповещения);
	
	ОбщийМодульКлиент.ПослеВыбораСсылкиДляПрикрепленияФайла(СсылкаНаОбъект, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПрикрепленияФайлаЗавершение(СтруктураРезультата, ДополнительныеПараметры) Экспорт
	
	Если СтруктураРезультата.Результат Тогда
		Элементы.Список.Обновить();
	КонецЕсли;	
	
КонецПроцедуры
